Count the number of missing values in each column of the dataset 'marks'.

In [23]:
import pandas as pd
marks = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/GZVBQG5pzJeNaL1ve50Rv9YNV/class-grades.csv')
marks.head()

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17    30.00     63.15  48.89
3       7       81.22     96.06    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89

In [24]:
marks.isnull().sum()

Prefix         0
Assignment     2
Tutorial      12
Midterm       16
TakeHome       9
Final          5
dtype: int64

### Removing rows with missing values
Description
Remove all the rows in the dataset 'marks' having 5 missing values and then print the number of missing values in each column.

In [25]:
import pandas as pd
marks = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/VodvGKvJAaeNrG7kvOQV38aog/class-grades.csv')

In [27]:
#marks= marks.drop(marks[marks.isnull().sum(axis=1)==5].index)
#marks= marks.dropna(thresh=5)
marks = marks[marks.isnull().sum(axis=1) != 5]
print(marks.isnull().sum())

Prefix         0
Assignment     0
Tutorial      10
Midterm       14
TakeHome       7
Final          3
dtype: int64

In [27]:
marks =  marks[marks.isnull().sum(axis=1)!=5]
marks.isnull().sum()

Prefix         0
Assignment     0
Tutorial      10
Midterm       14
TakeHome       7
Final          3
dtype: int64

### Removing extra characters from a column
Description
The given data frame 'customer' has a column 'Cust_id' which has values Cust_1, Cust_2 and so on.
Remove the repeated 'Cust_' from the column Cust_id so that the output column Cust_id have just numbers like 1, 2, 3 and so on.
Print the first 10 rows of the dataset  'customer' after processing.

In [38]:
import pandas as pd
customer = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/9B2ZPE1apMvqrLWx7p8ge9dqX/cust_dimen.csv')
customer.head()

        Customer_Name Province   Region Customer_Segment Cust_id
0  MUHAMMED MACINTYRE  NUNAVUT  NUNAVUT   SMALL BUSINESS  Cust_1
1        BARRY FRENCH  NUNAVUT  NUNAVUT         CONSUMER  Cust_2
2       CLAY ROZENDAL  NUNAVUT  NUNAVUT        CORPORATE  Cust_3
3      CARLOS SOLTERO  NUNAVUT  NUNAVUT         CONSUMER  Cust_4
4        CARL JACKSON  NUNAVUT  NUNAVUT        CORPORATE  Cust_5

In [39]:
#customer['Cust_id'] = customer.Cust_id.apply(lambda x:x[5:])
customer['Cust_id'] = customer.Cust_id.apply(lambda x: x.strip('Cust_'))
#customer['Cust_id'] = customer['Cust_id'].map(lambda x: x.strip('Cust_'))

In [40]:
customer.head(10)

        Customer_Name Province   Region Customer_Segment Cust_id
0  MUHAMMED MACINTYRE  NUNAVUT  NUNAVUT   SMALL BUSINESS       1
1        BARRY FRENCH  NUNAVUT  NUNAVUT         CONSUMER       2
2       CLAY ROZENDAL  NUNAVUT  NUNAVUT        CORPORATE       3
3      CARLOS SOLTERO  NUNAVUT  NUNAVUT         CONSUMER       4
4        CARL JACKSON  NUNAVUT  NUNAVUT        CORPORATE       5
5      MONICA FEDERLE  NUNAVUT  NUNAVUT        CORPORATE       6
6     DOROTHY BADDERS  NUNAVUT  NUNAVUT      HOME OFFICE       7
7     NEOLA SCHNEIDER  NUNAVUT  NUNAVUT      HOME OFFICE       8
8         CARLOS DALY  NUNAVUT  NUNAVUT      HOME OFFICE       9
9       CLAUDIA MINER  NUNAVUT  NUNAVUT   SMALL BUSINESS      10

In [29]:
import pandas as pd
df = pd.DataFrame({ 'A': [1,2,3,4], 
                   'B': [10,20,30,40],
                   'C': [20,40,60,80]
                  }, 
                  index=['Row 1', 'Row 2', 'Row 3', 'Row 4'])
df

       A   B   C
Row 1  1  10  20
Row 2  2  20  40
Row 3  3  30  60
Row 4  4  40  80

In [31]:
# Let's call this "custom_sum" as "sum" is a built-in function
def custom_sum(row):
    return row.sum()
#df['D'] = df.apply(custom_sum, axis=1)
df['D'] = df.apply(lambda x:x.sum(), axis=1)

df

       A   B   C      D
Row 1  1  10  20   31.0
Row 2  2  20  40   62.0
Row 3  3  30  60   93.0
Row 4  4  40  80  124.0

In [10]:
df.loc['Row 5'] = df.apply(custom_sum, axis=0)
df

        A    B    C    D
Row 1   1   10   20   31
Row 2   2   20   40   62
Row 3   3   30   60   93
Row 4   4   40   80  124
Row 5  10  100  200  310

In [11]:
df['E'] = df['C'].apply(lambda x:x*2)
df

        A    B    C    D    E
Row 1   1   10   20   31   40
Row 2   2   20   40   62   80
Row 3   3   30   60   93  120
Row 4   4   40   80  124  160
Row 5  10  100  200  310  400

In [12]:
def cal_multi_col(row):
    return [row['A'] * 2, row['B'] * 3]

In [13]:
res = df.apply(cal_multi_col, axis=1, result_type='expand')
df[res.columns] = res
df

        A    B    C    D    E   0    1
Row 1   1   10   20   31   40   2   30
Row 2   2   20   40   62   80   4   60
Row 3   3   30   60   93  120   6   90
Row 4   4   40   80  124  160   8  120
Row 5  10  100  200  310  400  20  300

In [14]:
df['New'] = df.apply(cal_multi_col, axis=1, result_type='reduce')
df

        A    B    C    D    E   0    1        New
Row 1   1   10   20   31   40   2   30    [2, 30]
Row 2   2   20   40   62   80   4   60    [4, 60]
Row 3   3   30   60   93  120   6   90    [6, 90]
Row 4   4   40   80  124  160   8  120   [8, 120]
Row 5  10  100  200  310  400  20  300  [20, 300]

In [17]:
import numpy as np
#df.applymap(np.square)
df

        A    B    C    D    E   0    1        New
Row 1   1   10   20   31   40   2   30    [2, 30]
Row 2   2   20   40   62   80   4   60    [4, 60]
Row 3   3   30   60   93  120   6   90    [6, 90]
Row 4   4   40   80  124  160   8  120   [8, 120]
Row 5  10  100  200  310  400  20  300  [20, 300]

### Duplicated Rows
Description
The given Dataframe 'rating' has repeated rows. You need to remove the duplicated rows.

In [43]:
import pandas as pd
rating = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/N45BN5xqWKpKNEnZP1qGKk5V3/rating_final.csv')

In [47]:
rating_update  = rating.drop_duplicates()

In [48]:
print(rating.shape)
print(rating_update.shape)

(1254, 5)
(1149, 5)

### Derived Variable
Description
The given dataset 'cust_rating' has 3 columns i.e 'rating', ' food_rating', 'service_rating'. Create a new variable 'avg_rating'.

In [50]:
import pandas as pd
cust_rating = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/GvOkzy5MLdy9zJ8vXMArwpRvN/rating_final.csv')
cust_rating

     userID  placeID  rating  food_rating  service_rating
0     U1077   135085       2            2               2
1     U1077   135038       2            2               1
2     U1077   132825       2            2               2
3     U1077   135060       1            2               2
4     U1068   135104       1            1               2
...     ...      ...     ...          ...             ...
1249  U1043   132630       1            1               1
1250  U1011   132715       1            1               0
1251  U1068   132733       1            1               0
1252  U1068   132594       1            1               1
1253  U1068   132660       0            0               0

[1254 rows x 5 columns]

In [60]:
#cust_rating['avg_rating'] = round( (cust_rating['rating']+ cust_rating['food_rating']+ cust_rating['service_rating'])/3)
#cust_rating['avg_rating'] = cust_rating.apply(lambda x:int(x.sum()/3), axis=1)
cust_rating['avg_rating']  = round(cust_rating.iloc[:,-3:].sum(axis=1)/3)

In [61]:
print(cust_rating.head(10))

  userID  placeID  rating  food_rating  service_rating  avg_rating
0  U1077   135085       2            2               2         2.0
1  U1077   135038       2            2               1         2.0
2  U1077   132825       2            2               2         2.0
3  U1077   135060       1            2               2         2.0
4  U1068   135104       1            1               2         1.0
5  U1068   132740       0            0               0         0.0
6  U1068   132663       1            1               1         1.0
7  U1068   132732       0            0               0         0.0
8  U1068   132630       1            1               1         1.0
9  U1067   132584       2            2               2         2.0

### Extracting Day From a Date
Description
The given dataset 'order' has a variable 'Order_Date' with the dates of purchase.
Create a new variable 'day' which will contain the day from the date at variable Order_Date.

In [62]:
import pandas as pd
order = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/0gjkvLLgNdQLqG10jo5yyJyjK/orders_dimen.csv')

In [65]:
#order['day'] =order['Order_Date'].dt.day

order['Order_Date'] = pd.to_datetime(order['Order_Date'])
order['day']= order.Order_Date.apply(lambda x:x.day)
print(order.head(10))

   Order_ID Order_Date Order_Priority  Ord_id  day
0         3 2010-10-13            LOW   Ord_1   13
1       293 2012-01-10           HIGH   Ord_2   10
2       483 2011-10-07           HIGH   Ord_3    7
3       515 2010-08-28  NOT SPECIFIED   Ord_4   28
4       613 2011-06-17           HIGH   Ord_5   17
5       643 2011-03-24           HIGH   Ord_6   24
6       678 2010-02-26            LOW   Ord_7   26
7       807 2010-11-23         MEDIUM   Ord_8   23
8       868 2012-08-06  NOT SPECIFIED   Ord_9    6
9       933 2012-04-08  NOT SPECIFIED  Ord_10    8

### Generating Binomial Distribution
Description
Generate a binomial distribution, tested 10 times, given the number of trials(n) and probability(p) of each trial.
The input will contain seed, n and p in the same order.
The output should contain a numpy array with 10 numbers representing the required binomial distribution.
Hint: You can use numpy's random number generator here too. Remember to set the seed before generating numbers to ensure correct output

In [70]:
import numpy as np
seed = int(input())
n=int(input())
p=float(input())

np.random.seed(seed)
s = np.random.binomial(n,p,10)

print(s)

4
5
10

ValueError: p < 0, p > 1 or p is NaN

### Coloured cards
Description
A card stack contains white and black cards. Two cards are drawn randomly without replacement. The probability of selecting a white and then a black card is x. The probability of selecting a white card in the first draw is y. You have to find the probability of drawing a black card, given that the first card drawn was white.
The input will contain two lines with x and y respectively.  
The output should be displayed as a float(no need to round it off).

In [2]:
x=float(input())
y=float(input())
#write your code here
#P(W) = y and P(B intersection W) = x......P(z) = x/y
z = x/y
print(z)

10
5
2.0

### Entrance Test
Description
Consider that the scores of an entrance test are normally distributed. 
If the test has a mean of m and a standard deviation of s.
You have set the cut off as 90 marks for the test. What is the probability of a student passing the test?
The input will contain m and s in two lines in the same order. The output has to be rounded off to two decimal places.

Please note that if the answer is 3.6, it is to be reported as 3.6 and not 3.60

In [77]:
import scipy.stats

m=float(input())#mean
sd=float(input())#standard deviation


print(round(1-scipy.stats.norm(m,sd).cdf(90),2))

90
10
0.5

### Seating Arrangement
Description
N people sit around a circular table. You have to find the probability that two particular people won't be sitting together.

The input will have the number N and the output should have the probability printed as a float type number rounded off to four decimal places.

Hint: This problem follows the logic of circular permutation which you can read about here.

In [7]:
n=int(input())
result = round((n-3)/(n-1),4)
print(result)

10
0.7778

In [8]:
int(input())
import math
print(round(1-math.factorial(n-2)*math.factorial(2)/math.factorial(n-1),4))

10
0.7778

### Flatten a list

Description
Given a nested list, write python code to flatten the list.
Note: The input list will strictly have 2 levels, i.e. the list will be of the form [[1,2],[3,4]]. Inputs like [1,[2,3]] and [[1,[2,3],4],5] are not applicable.

In [94]:
import ast,sys
#input_str = sys.stdin.read()
#input_list = ast.literal_eval(input_str)
input_list = [[1,2,3],[4,5],[6,7,8,9]]

flat_list = []
def flatten_list(input_list):
    for sublist in input_list:
        for item in sublist:
            flat_list.append(item)

flatten_list(input_list)       
print(flat_list)

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [95]:
import itertools

input_list = [[1,2,3],[4,5],[6,7,8,9]]
flat_list = [item for sublist in input_list for item in sublist]
flat_list

[1, 2, 3, 4, 5, 6, 7, 8, 9]

### Squares
Description
Given a list of positive integers, you have to find numbers divisible by 3 and replace them with their squares. 
For example, consider the list below:
Input: [1,2,3,4,5,6]
The output for the above list would be: [1,2,9,4,5,36]. Because 3 and 6 were divisible by 3, these numbers were replaced with their squares.

In [11]:
import ast,sys
#input_str = sys.stdin.read()
#input_list = ast.literal_eval(input_str)
input_list = [1,2,3,4,5,6]

for i in range(len(input_list)):
    if input_list[i]%3==0:
        input_list[i] = input_list[i]**2
        
print(input_list)

[1, 2, 9, 4, 5, 36]

In [100]:
input_list = [1,2,3,4,5,6]
squared_list = [ item**2 if item%3==0 else item for item in input_list]
squared_list

[1, 2, 9, 4, 5, 36]

### A weird sum
Description
Write a program that computes the value of n+nn+nnn+nnnn with a given digit as the value of n.
For example, if n=9 , then you have to find the value of 9+99+999+9999.

In [102]:
n=int(input())
temp=0
weird_sum=0
for i in range(4):
    temp = n + temp*10
    weird_sum += temp

print(weird_sum)

9
11106

### Frequent Letters
Description
Given a string, you have to find the first n most frequent characters in it.

You have to print these n letters in alphabetically sorted order.

The input will contain two lines, the first line will contain a string and the second line will contain the letter n.

The output should be a list of n most frequent letters in alphabetically sorted order.

Note: If there are two letters with the same frequency, then the alphabetically preceding alphabet should be picked first. (For example, in "aabbccc", if n=2, then output list would have c and a.)

Sample Input:

ddddaacccb

In [16]:
string=input()
n=int(input())

def most_frequent_char(string,n):
  freq_char = dict()
  for char in string:
    if char not in freq_char.keys():
      freq_char[char] = 1
    else:
      freq_char[char] += 1

  char_tuples = sorted(freq_char.items(), key=lambda x: (-x[1],x[0]))[:n]
  
  final_list = []
  for chars in char_tuples:
    final_list.append(chars[0])
  return(sorted(final_list))

print(most_frequent_char(string,n))

ddddaacccb
3
['a', 'c', 'd']

In [105]:
string=input()
n=int(input())
import collections
out=[collections.Counter(string).most_common(i+1)[i][0] for i in range(n)]
out.sort()
print(out)

ddddcccaab
3
['a', 'c', 'd']

### 2D array
Description
Write Python code which takes 2 numbers x and y as input and generates a 2-dimensional numpy array where value in the i-th row and j-th column of the array should be (i+j)/2.
Note: i=0,1,...x-1 and j=0,1....,y-1
The input will have two lines with x and y respectively.
The output should be a 2D numpy array.

In [106]:
import numpy as np
x=int(input())
y=int(input())

def td_array(x,y):
    return np.matrix([[(row+col)/2 for col in range(y)] for row in range(x)])

print(td_array(x,y))

3
4
[[0.  0.5 1.  1.5]
 [0.5 1.  1.5 2. ]
 [1.  1.5 2.  2.5]]

In [20]:
x=int(input())
y=int(input())
from numpy import zeros
a = zeros([x,y])
for row in range(x):
    for col in range(y):
        a[row][col]= (row+col)/2
print(a)

3
4
[[0.  0.5 1.  1.5]
 [0.5 1.  1.5 2. ]
 [1.  1.5 2.  2.5]]

### Contiguous list
Given a list as input, your task is to check if the list is strictly increasing. i.e. the numbers in the list should be in an increasing order. Hence, a number at a lower index should always be smaller than a number at a higher index.
Assume that the list will only have positive integers.
Print "yes" if the list is in strictly increasing order and print "no" if the list is not strictly increasing. 

Sample Input:
[1,4,300,400,900]
Sample Output:
yes

In [110]:
import ast,sys
#nput_str = sys.stdin.read()
#input_list = ast.literal_eval(input_str)
input_list = [1,3,4,400,900] 
if(all(i<j for i,j in zip(input_list, input_list[1:]))):
    print("yes")
else:
    print("no")

yes

### Odd or Even Sum
Given a positive integer as input, you have to find whether the sum of its digits is odd or even.

The input will have a positive integer and the output should say "odd" if the sum of its digits is odd and "even" if the sum of its digits is even.

Sample Input:
1234567
Sample Output:
even

In [120]:
n=int(input())
if sum(map(int, str(n)))%2:
    print("odd")
else:
    print("even")

123
even

### Vote for Food
Your team is going for camping and you are taking a vote to decide what food to pack for dinner.
Everyone gets a vote and the food item that gets at least one more than half of the votes wins. None of the items wins if nothing gets at least one more than half votes. Assume that every person gets only one vote.
The input will contain a list of food items where each occurrence of an item represents one vote. You should print the winning food item as output. If there is no clear winner, print "NOTA". 

Sample Input:
["pasta","pasta","pasta","pasta","pasta","paratha","paratha","paratha"]
Sample Output:
pasta

In [55]:
import ast,sys
#input_str = sys.stdin.read()
#votes = ast.literal_eval(input_str)
votes = ["pasta","pasta","pasta","pasta","pasta","paratha","paratha","paratha"]

flag = 0
vote_size = len(votes) 
vote_values = {}

for vote in votes:
    if vote in vote_values:
        vote_values[vote] += 1
    else:
        vote_values[vote] = 1
        
for vote_value in vote_values.keys():
    if vote_values[vote_value] > vote_size/2:
        print(vote_value)
        flag = 1
        break
    
if flag == 0 :
    print("NOTA")

pasta

In [124]:
votes = ["pasta","pasta","pasta","pasta","pasta","paratha","paratha","paratha"]

def dinner(votes):
    for i in set(votes):
        if votes.count(i)>len(votes)//2:
            return i
    return "NOTA"
print(dinner(votes))

5
{'paratha', 'pasta', 'banana'}
pasta

### BMI Groups
Description
Create another feature based called BMI_group which groups people based on their BMI. The groups should be as follows:
Underweight: BMI is less than 18.5.
Normal: BMI is 18.5 to 24.9.
Overweight: BMI is 25 to 29.9.
Obese: BMI is 30 or more.
The grouping is based on WHO standards.

The output should have first five rows of the resulting dataframe

In [126]:
import pandas as pd 
df=pd.read_csv("https://media-doselect.s3.amazonaws.com/generic/OzvzVqK4pgg4x7qEadoZMRyVR/insurance.csv")
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [127]:
def bmi_group(val):
    if(val<18.5):
        return "Underweight"
    if (val>=18.5) & (val<24.9):
        return "Normal"
    if (val>=24.9) & (val<=29.9):
        return "Overweight"
    if val>=30:
        return "Obese"
df["BMI_group"] = df.bmi.apply(bmi_group)    
df.head()

   age     sex     bmi  children smoker     region      charges   BMI_group
0   19  female  27.900         0    yes  southwest  16884.92400  Overweight
1   18    male  33.770         1     no  southeast   1725.55230       Obese
2   28    male  33.000         3     no  southeast   4449.46200       Obese
3   33    male  22.705         0     no  northwest  21984.47061      Normal
4   32    male  28.880         0     no  northwest   3866.85520  Overweight

### Handling Categorical Variables
Description
Encode all categorical features such that they can be used in a regression model.
i.e.
sex, BMI_group, smoker and region should be labelled properly.

Note: Use the label encoder for all features. You can read more about it here.

The output should have first five rows of the resulting dataframe.

In [60]:
import pandas as pd 
from sklearn.preprocessing import LabelEncoder
pd.set_option('display.max_columns', 500)
df=pd.read_csv("https://media-doselect.s3.amazonaws.com/generic/831JKKEkW7kqd5M4evNva9LyB/insurance_grouped.csv")
le = LabelEncoder()#use this encoder to encode values

In [61]:
#sex
le.fit(df.sex.drop_duplicates()) 
df.sex = le.transform(df.sex)
# smoker or not
le.fit(df.smoker.drop_duplicates()) 
df.smoker = le.transform(df.smoker)
#region
le.fit(df.region.drop_duplicates()) 
df.region = le.transform(df.region)
#changing data type
df.BMI_group=df.BMI_group.astype(str)
le.fit(df.BMI_group.drop_duplicates()) 
df.BMI_group = le.transform(df.BMI_group)
print(df.head())

   age  sex     bmi  children  smoker  region      charges  BMI_group
0   19    0  27.900         0       1       3  16884.92400          2
1   18    1  33.770         1       0       2   1725.55230          1
2   28    1  33.000         3       0       2   4449.46200          1
3   33    1  22.705         0       0       1  21984.47061          0
4   32    1  28.880         0       0       1   3866.85520          2

### Smoking kills
Description
As everyone knows, smoking is a major cause of bad health. Here, try to find if smoking is affecting health of people.
Print the correlation value of "smoker" columns with "bmi", "age"  and "charges" columns in three lines respectively.

Note: You should round off all three values till four decimal places using the round() function.

In [64]:
import pandas as pd 
df=pd.read_csv("https://media-doselect.s3.amazonaws.com/generic/B5yO4wkEbQk4dVGn8140yV1bx/insurance_encoded.csv")
print(round(df['smoker'].corr(df['bmi']), 4))
print(round(df['smoker'].corr(df['age']), 4))
print(round(df['smoker'].corr(df['charges']), 4))

0.0038
-0.025
0.7873

### Sorting list of tuples
You are provided with a list of tuples having three elements, name, age and salary. You are required to arrange the tuples in order of any of the three elements. The variable (name/age/salary) has to be decided by the second input, which is an integer (1 : name, 2 : Age, 3 : Salary). Make sure that the ordering should be ascending.

In [70]:
import ast
#Accept user input as string from stdin
input_str = input()
#ast.literal_eval raises an exception if the input isn't a valid Python datatype.
#The string or node provided may only consist of the following Python literal structures: strings, numbers, tuples, lists, dicts, booleans, and None.
input_list = ast.literal_eval(input_str)
#Accept second input for selecting field for sorting
sorting_choice = int(input())

# Your code goes hereimport ast,sys

print(sorted(input_list, key=lambda x: x[sorting_choice-1]))

[('Ram', 23 , 3000) , ('Mohan' , 22 , 4000 ) , ( 'Suresh' , 19 , 8000)]
2
[('Suresh', 19, 8000), ('Mohan', 22, 4000), ('Ram', 23, 3000)]

### What's Missing?
For a given list of integers in increasing order from n to m with no duplicates and common difference between two consecutive numbers being 1 except where the number is missing  with total  m-n integers in list, find out the missing number.

In [72]:
# Import the relevant libraries
import ast,sys

# Read the input list

#input_str = sys.stdin.read()
#input_list = ast.literal_eval(input_str)
input_list = [ 8,9,10,12]
# Write your code here

mn = min(input_list)   # Get the first no of the list
mx= max(input_list)    # Get the last no of the list
n= mx-mn+1 # 4-1+1
total = n*(2*mn + n-1 )/2 # 4x(2*1+(3-1))/2
sum_of_input = sum(input_list) 
print(int(total - sum_of_input))

11

In [140]:
input_list = [8,9,10,12]

def find_missing(lst):
    return [x for x in range(lst[0], lst[-1]+1) 
                               if x not in lst]
print(find_missing(input_list))

[11]

### Finding common letters in string
You are provided two strings. You have to determine the common letters in the two strings. Make sure that the case difference is kept in mind. 'A' is not the same as 'a'. Also, note that the common letters are ordered in their alphabetical order.

In [153]:
# Take the strings as input

s1=input()
s2=input()

# Write your code below

unique_1 = [w for w in set(s1) if w in s2]

if len(unique_1):
    print('The common letters are:')
    print(''.join(sorted(unique_1))) 
else:
    print('There are no common letters between them')

rahull
rajeev
The common letters are:
ar

In [18]:
# Take the strings as input

s1=input()
s2=input()

# Write your code below

a=list(set(s1)&set(s2))
a.sort()
if len(a):
    print('The common letters are:')
    for i in a:
        print(i)
else:
    print('There are no common letters between them')

sdsdsd
dfdfdfd
The common letters are:
d

### Join String
Given a list of strings, join them using the delimiter  '-'

In [74]:
# Import the relevant libraries

import ast,sys

# Read the input list

input_str = sys.stdin.read()
#input_list = ast.literal_eval(input_str)
input_list = ['Accountability', 'and', 'Ownership']

# Write your code here
print('-'.join(input_list))

Accountability-and-Ownership

### Break the list
Write a Python program to divide a given list into chunks of size k.

The number of elements in the list need not to be divisible by k.
For example, if you want to divide the list [1,2,3,4,5,6,7] into chunk size k=4, then the first chunk will be [1,2,3,4] and the second one will have [5,6,7]. i.e. the last chunk need not have k elements.
The input will have two lines, the first line would have the list and the second line would have the value of k.(the code for taking input has already been written, you should not change that)
The final output should have the list chunks in different lines.

Sample Input:
[1,2,3,4,5,6,7,8,9]
3

In [17]:
import ast,sys
input_str = sys.stdin.read()
#input_list = ast.literal_eval(input_str)
input_list = [[1,2,3,4,5,6,7,8,9],4]

lis=input_list[0]
k=input_list[1]

for i in range(0, len(lis), k):  
    print(lis[i:i + k])

[1, 2, 3, 4]
[5, 6, 7, 8]
[9]

In [14]:
import numpy as np
# create list
my_list = [0,0,1,1,2,2,3,3]
# convert list to numpy array
np_array=np.asarray(my_list)
# reshape array into 4 rows x 2 columns, and transpose the result
reshaped_array = np_array.reshape(4, :).T 

#check the result
reshaped_array.tolist()

SyntaxError: invalid syntax (2881183860.py, line 7)

### Scrabble
Assume that you are trying to complete a crossword puzzle. In a crossword puzzle, some letters are given and you have to figure out which complete word can you make out of it.
For example, given letters "cwd"in the same order, you can make the word  "crossword" or "crowd" with it. But if "dw" is given in that order, you cannot make "crossword" out of it because d and w are in the opposite order here.

You want to find an efficient method and write a code for this process. 
The code will take two strings as input in two lines. The first string will contain letters on the crossword("cwd"), and the second string will contain a word that you want to check.(i.e. you want to check whether the word can be made out of given letters in the same order).
The output should say "yes" if the word can be formed, else it should say "no"
Sample Input 1:
ccwd
crossword

In [1]:
import re
letters=input()#letters already in the crossword
guess=input()#word to check for fit
x = re.findall(".*".join(list(letters)),guess)
if x:
    print("yes")
else:
    print("no")

cwd
crossword
yes

### Paying the rent
You are moving to a new city for an internship for a few months and have to rent a house for that purpose.
You have to pay the full month's house rent even if you have lived for a few days for that month. i.e. if you start on 15th Jan and leave by 15th May, you still have to pay full rent for months of Jan and May too.

Your task is to find the months that you have to pay rent for so that you can write post-dated cheques to your landlord.

You will be given two dates as input and your task is to print all months between the dates including the months the dates are from.
The input will contain the two dates in a list as follows:
[2017,1,1,2017,3,4] which corresponds to 1st Jan, 2017 and 4th March, 2017. This date is in the format(yyyy,mm,dd)
(the code for taking input has already been written for you, please don't modify that)
The output should contain a list with names of months you have to pay the rent for(the list should be sorted chronologically  based on months, i.e May should come before August). You can assume that there won't be more than 12 months between two dates.
You'll need to use the datetime module for this problem which can be referred to here. You can choose to use any other method too.

In [14]:
import datetime
import ast,sys
input_str = sys.stdin.read()
#input_list = ast.literal_eval(input_str)
#input_list = [2017,1,1,2017,1,1]
input_list = [2017,8,2,2018,1,1]
dateStart=datetime.date(input_list[0],input_list[1],input_list[2])
dateEnd=datetime.date(input_list[3],input_list[4],input_list[5])
months = ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December']

ans = set()
while dateStart <= dateEnd:
    ans.add(dateStart.month)
    dateStart += datetime.timedelta(1)
print([months[x-1] for x in sorted(ans)])

['January', 'August', 'September', 'October', 'November', 'December']

### Remove empty lists
Write a Python program to eliminate all empty lists from a given list of lists.
The input will have a list of lists and the output should have the resulting list after eliminating empty lists from it.
[[1,2,3],[],[4,5],[],[],[6,7,8]]

In [21]:
import ast,sys
input_str = sys.stdin.read()
#input_list = ast.literal_eval(input_str)
input_list = [[1,2,3],[],[4,5],[],[],[6,7,8]]

list=[l for l in input_list if l!= []] 
print(list)

[[1, 2, 3], [4, 5], [6, 7, 8]]